org/posts/2020-08-02-whats-ap-with-zio-prelude.org
#+AUTHOR: Justin Heyes-Jones
#+TITLE: #+TITLE: What's Ap with zio-prelude?
#+DATE: 2020
#+STARTUP: showall
#+OPTIONS: toc:nil
#+HTML_HTML5_FANCY:
#+CREATOR: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="http://orgmode.org">Org</a> mode 9.4)
#+BEGIN_EXPORT html
---
layout: post
title: What's Ap with zio-prelude?
tags: [pure-functional-programming, cats, scala, applicative, monads, functors, zio]
---
<link rel="stylesheet" type="text/css" href="../../../_orgcss/site.css" />
#+END_EXPORT
** What's ZIO Prelude
Recently, ZIO creators, John De Goes and Adam Fraser, presented their
latest functional programming library to the world. ZIO Prelude,
hereafter referred to as Prelude, is promised as a radical shift in
the way functional programming is taught, implemented and used. The
event was the online edition of the SF Scala meetup, and the talk is
now available on YouTube [[https://youtu.be/OwmHgL9F_9Q][SF Scala: Reimagining Functional Type
Classes]]. You can also visit the source code on Github [[https://github.com/zio/zio-prelude][zio-prelude]].

For those that don't know, Prelude was initially developed, I'm told, as part of
John De Goes's "Spartan" training program, so I wasn't able to follow it since
its inception. I've been looking forward to the release since I heard about it,
especially since John has alluded to a new type class encoding for a few years,
for example in this talk at flatMap Oslo 2018
https://www.youtube.com/watch?v=sFGnFKMSmL0&t=1462s

In this post I will give my first impressions, having watched the talk and spent
a few hours playing around with the library. At this stage, the nascent library
is still undergoing rapid changes, so some of what I write here will likely be
outdated fairly soon. I'm also new to the library, so if I make any mistakes
feel free to contact me and I will correct them.

** What's ap with ZIO Prelude?
Prior to the talk John tweeted:

#+BEGIN_QUOTE
For a decade, 'ap' from Applicative has infected Scala code:

def ap[A, B](f: F[A => B], fa: F[A]): F[B]

Cryptic & confusing, did you know the raison d'être of 'ap' is Haskell's curried functions, not category theory?

Learn how we can do better! - John De Goes
#+END_QUOTE

This also piqued my curiosity as I have talked about Applicative publicly quite
a bit this year including at online meetups and the Scala Love conference. I
also wrote a lengthy blog post on Applicative Programming with Effects.

#+BEGIN_EXPORT html
<a href="/2020/04/04/whats-ap.html">What's Ap?</a>
#+END_EXPORT

John has pointed out [[https://www.reddit.com/r/scala/comments/afor0h/scalaz_8_timeline/eeac71m/][before]] that Ap is not a great ergonomic fit for Scala
(currying is much more natural in Haskell). Ap is hard to teach because of this;
a lot of Scala developers find currying tricky. It is, however, an important
part of the language, and a useful tool for every Scala programmers toolbox.

- https://docs.scala-lang.org/tour/multiple-parameter-lists.html
- https://alvinalexander.com/scala/fp-book/partially-applied-functions-currying-in-scala/

Later in the post, I will try to reimplement some of my sample code from the
What's Ap post, and see how well Prelude replaces Applicative, both from the
developer perspective and in terms of how easy each would be to teach.

From this point of view I will be approaching Prelude in a way that it is not
designed for; mapping the Haskell style class hierarchy to Prelude. We shouldn't
judge it on that basis, but since John threw down the gauntlet I will accept the
challenge to defend my friend the Applicative.

** Goals of Prelude
As you'll see in the [[https://www.slideshare.net/jdegoes/refactoring-functional-type-classes][slide deck]], the goals of prelude are to be the following:

- Radical
- Orthogonal
- Principled
- Scala-First
- Minimal
- Pragmatic
- Accessible
- Opinionated

The goals I find most compelling here are accessible and orthogonal. As a
functional programming advocate and educator, I am very interested in any steps
towards greater accessibility. The orthogonal part is also key, as I believe
that composability is one of the biggest wins of pure functional programs.

** Algebras, not Category Theory
With Cats, almost all of the concepts come from category theory. We have Monads,
Functors, Monoids, Monoidal Functors and so on. The idea with prelude is that
algebra is more familiar to us, as non-mathematician programmers than category
theory. Algebras are also more composable, so the idea is to start with a small
number of primitive things(?) and combining them into more powerful objects.

The big question that prelude puts out there is this; is Category Theory an
obstacle to adoption of pure functional programming, and would abstract algebra
be a better way to both introduce newcomers, and provide a better solution
overall to the problems and applications that Cats et al already address?

** Functor and Monad
