_posts/2020-08-02-whats-ap-with-zio-prelude.html
---
layout: post
title: What's Ap with zio-prelude?
tags: [pure-functional-programming, cats, scala, applicative, monads, functors, zio, popular]
---
<link rel="stylesheet" type="text/css" href="../../../_orgcss/site.css" />
<div id="outline-container-orga816b2d" class="outline-2">
<h2 id="orga816b2d">What's ZIO Prelude</h2>
<div class="outline-text-2" id="text-orga816b2d">
<p>
Recently, ZIO creators, John De Goes and Adam Fraser, presented their
latest functional programming library to the world. ZIO Prelude,
hereafter referred to as Prelude, is promised as a radical shift in
the way functional programming is taught, implemented and used. The
event was the online edition of the SF Scala meetup, and the talk is
now available on YouTube <a href="https://youtu.be/OwmHgL9F_9Q">SF Scala: Reimagining Functional Type
Classes</a>. You can also visit the source code on Github <a href="https://github.com/zio/zio-prelude">zio-prelude</a>.
</p>

<p>
For those that don't know, Prelude was initially developed, I'm told, as part of
John De Goes's "Spartan" training program, so I wasn't able to follow it since
its inception. I've been looking forward to the release since I heard about it,
especially since John has alluded to a new type class encoding for a few years,
for example in this talk at flatMap Oslo 2018
<a href="https://www.youtube.com/watch?v=sFGnFKMSmL0&amp;t=1462s">https://www.youtube.com/watch?v=sFGnFKMSmL0&amp;t=1462s</a>
</p>

<p>
In this post I will give my first impressions, having watched the talk and spent
a few hours playing around with the library. At this stage, the nascent library
is still undergoing rapid changes, so some of what I write here will likely be
outdated fairly soon. I'm also new to the library, so if I make any mistakes
feel free to contact me and I will correct them.
</p>
</div>
</div>

<div id="outline-container-orgc98e2ee" class="outline-2">
<h2 id="orgc98e2ee">What's ap with ZIO Prelude?</h2>
<div class="outline-text-2" id="text-orgc98e2ee">
<p>
Prior to the talk John tweeted:
</p>

<blockquote>
<p>
For a decade, 'ap' from Applicative has infected Scala code:
</p>

<p>
def ap[A, B](f: F[A =&gt; B], fa: F[A]): F[B]
</p>

<p>
Cryptic &amp; confusing, did you know the raison d'être of 'ap' is Haskell's curried functions, not category theory?
</p>

<p>
Learn how we can do better! - John De Goes
</p>
</blockquote>

<p>
This also piqued my curiosity as I have talked about Applicative publicly quite
a bit this year including at online meetups and the Scala Love conference. I
also wrote a lengthy blog post on Applicative Programming with Effects.
</p>

<a href="/2020/04/04/whats-ap.html">What's Ap?</a>

<p>
John has pointed out <a href="https://www.reddit.com/r/scala/comments/afor0h/scalaz_8_timeline/eeac71m/">before</a> that Ap is not a great ergonomic fit for Scala
(currying is much more natural in Haskell). Ap is hard to teach because of this;
a lot of Scala developers find currying tricky. It is, however, an important
part of the language, and a useful tool for every Scala programmers toolbox.
</p>

<ul class="org-ul">
<li><a href="https://docs.scala-lang.org/tour/multiple-parameter-lists.html">https://docs.scala-lang.org/tour/multiple-parameter-lists.html</a></li>
<li><a href="https://alvinalexander.com/scala/fp-book/partially-applied-functions-currying-in-scala/">https://alvinalexander.com/scala/fp-book/partially-applied-functions-currying-in-scala/</a></li>
</ul>

<p>
Later in the post, I will try to reimplement some of my sample code from the
What's Ap post, and see how well Prelude replaces Applicative, both from the
developer perspective and in terms of how easy each would be to teach.
</p>

<p>
From this point of view I will be approaching Prelude in a way that it is not
designed for; mapping the Haskell style class hierarchy to Prelude. We shouldn't
judge it on that basis, but since John threw down the gauntlet I will accept the
challenge to defend my friend the Applicative.
</p>
</div>
</div>

<div id="outline-container-org834b5c7" class="outline-2">
<h2 id="org834b5c7">Goals of Prelude</h2>
<div class="outline-text-2" id="text-org834b5c7">
<p>
As you'll see in the <a href="https://www.slideshare.net/jdegoes/refactoring-functional-type-classes">slide deck</a>, the goals of prelude are to be the following:
</p>

<ul class="org-ul">
<li>Radical</li>
<li>Orthogonal</li>
<li>Principled</li>
<li>Scala-First</li>
<li>Minimal</li>
<li>Pragmatic</li>
<li>Accessible</li>
<li>Opinionated</li>
</ul>

<p>
The goals I find most compelling here are accessible and orthogonal. As a
functional programming advocate and educator, I am very interested in any steps
towards greater accessibility. The orthogonal part is also key, as I believe
that composability is one of the biggest wins of pure functional programs.
</p>
</div>
</div>

<div id="outline-container-org04a3aca" class="outline-2">
<h2 id="org04a3aca">Algebras, not Category Theory</h2>
<div class="outline-text-2" id="text-org04a3aca">
<p>
With Cats, almost all of the concepts come from category theory. We have Monads,
Functors, Monoids, Monoidal Functors and so on. The idea with prelude is that
algebra is more familiar to us, as non-mathematician programmers than category
theory. Algebras are also more composable, so the idea is to start with a small
number of primitive things(?) and combining them into more powerful objects.
</p>

<p>
The big question that prelude puts out there is this; is Category Theory an
obstacle to adoption of pure functional programming, and would abstract algebra
be a better way to both introduce newcomers, and provide a better solution
overall to the problems and applications that Cats et al already address?
</p>
</div>
</div>
