org/posts/2020-08-02-whats-ap-with-zio-prelude.org
*** Functors (Covariant)
In my original post, I introduce Functor and Monad as the gateway to
Applicative. Functor is a simple and beautiful thing, in that it allows us to
combine pure functions with "effectful" computations, mapping an F[A] to an
F[B]. In prelude Functor and Monad do not exist as first-class entities,
although we can see them defined as type aliases. This seems to be more
documentation than practical as the type aliases are not used anywhere in the
code.

#+BEGIN_SRC scala
type Functor[F[+_]] = Covariant[F]
type Monad[F[+_]] = Covariant[F] with IdentityFlatten[F]
#+END_SRC

In Cats the Functor type class is short for Covariant Functor. What does that
mean? First of all one of the best discussions of covariance in Scala I know can
be found here on the scala-lang.org site:

https://docs.scala-lang.org/tour/variances.html

In essence, a covariant type parameter, for example with List[+A], means that you
if B is a subtype of A, then List[B] is a subtype of List[A].

The Cats Functor is also covariant in that if you have a function that can map
an A to a B, you can map a higher-kinded type F[A] to F[B] too using the
Covariant Functor.

In Cats a Functor is defined as a higher-kinded type with a map function. In
Prelude a Functor is just something that implements the Covariant type and
follows its laws.

Functor has essentially changed names in Prelude, it is on the surface the same as
the Cats Functor.

#+BEGIN_SRC scala
List(1,2,3).map(a => a + 1)
// List[Int] = List(2, 3, 4)
Option(1).map(a => a + 1)
// Option[Int] = Some(2)
#+END_SRC

There is an excellent post about variance and functors on the Typelevel site:

https://typelevel.org/blog/2016/02/04/variance-and-functors.html

You can take a look at the implementation of Covariant here:

https://github.com/zio/zio-prelude/blob/master/src/main/scala/zio/prelude/Covariant.scala

It's nice that each abstraction, or algebra, has it's own file, and in that file
you'll find the following.

1. A trait defining the interface to the algebra. For example, Covariant defines
   map and a couple of other functions. In this respect it is similar to Cats.
2. Laws. The companion object contains the laws to test the algebra directly.
   Each object has a ~laws~ member that can be checked with the package objects
   ~checkAllLaws~ method.
3. Instances. Rather than have instances in a separate file or package, they are
   also embedded in the companion. It's nice to have them all easily listed in
   the same place. Most algebras have instances for some appropriate standard
   library types, as well as some "ZIO" types like ~ZIO~ itself and ~Chunk~ and
   new Prelude types like ~ZPure~ which we will get into in a later post.
   Another thing I like is the code documentation is laid out like this
   ~`Covariant` instance for `Chunk`~ so that if you want to find, say, all the
   instances for ZIO you can do do a global text search for ~instance for `ZIO`~
   and you'll find them. This kind of thoughtful ergonomics is much appreciated.
4. Finally, at the end of the object implememtation you will find some syntax.
   If you ever struggled with imports in Scalaz and Cats, you may appreciate
   this one file per algebra layout.

