_posts/2020-08-02-whats-ap-with-zio-prelude.html

<div id="outline-container-org80929e9" class="outline-2">
<h2 id="org80929e9">Functor and Monad</h2>
<div class="outline-text-2" id="text-org80929e9">
</div>
<div id="outline-container-org8fdfc10" class="outline-3">
<h3 id="org8fdfc10">Functors (Covariant)</h3>
<div class="outline-text-3" id="text-org8fdfc10">
<p>
In my original post, I introduce Functor and Monad as the gateway to
Applicative. Functor is a simple and beautiful thing, in that it allows us to
combine pure functions with "effectful" computations, mapping an F[A] to an
F[B]. In prelude Functor and Monad do not exist as first-class entities,
although we can see them defined as type aliases. This seems to be more
documentation than practical as the type aliases are not used anywhere in the
code.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">type</span> <span style="color: #00bcff;">Functor</span>[<span style="color: #00bcff;">F</span>[+<span style="color: #b6a0ff;">_</span>]] <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">Covariant</span>[<span style="color: #00bcff;">F</span>]
<span style="color: #b6a0ff;">type</span> <span style="color: #00bcff;">Monad</span>[<span style="color: #00bcff;">F</span>[+<span style="color: #b6a0ff;">_</span>]] <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">Covariant</span>[<span style="color: #00bcff;">F</span>] <span style="color: #b6a0ff;">with</span> <span style="color: #6ae4b9;">IdentityFlatten</span>[<span style="color: #00bcff;">F</span>]
</pre>
</div>

<p>
In Cats the Functor type class is short for Covariant Functor. What does that
mean? First of all one of the best discussions of covariance in Scala I know can
be found here on the scala-lang.org site:
</p>

<p>
<a href="https://docs.scala-lang.org/tour/variances.html">https://docs.scala-lang.org/tour/variances.html</a>
</p>

<p>
In essence, a covariant type parameter, for example with List[+A], means that you
if B is a subtype of A, then List[B] is a subtype of List[A].
</p>

<p>
The Cats Functor is also covariant in that if you have a function that can map
an A to a B, you can map a higher-kinded type F[A] to F[B] too using the
Covariant Functor.
</p>

<p>
In Cats a Functor is defined as a higher-kinded type with a map function. In
Prelude a Functor is just something that implements the Covariant type and
follows its laws.
</p>

<p>
Functor has essentially changed names in Prelude, it is on the surface the same as
the Cats Functor.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #00bcff;">List</span>(<span style="color: #00bcff;">1</span>,<span style="color: #00bcff;">2</span>,<span style="color: #00bcff;">3</span>).map(a <span style="color: #b6a0ff;">=&gt;</span> a + <span style="color: #00bcff;">1</span>)
<span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">List[Int] = List(2, 3, 4)</span>
<span style="color: #00bcff;">Option</span>(<span style="color: #00bcff;">1</span>).map(a <span style="color: #b6a0ff;">=&gt;</span> a + <span style="color: #00bcff;">1</span>)
<span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">Option[Int] = Some(2)</span>
</pre>
</div>

<p>
There is an excellent post about variance and functors on the Typelevel site:
</p>

<p>
<a href="https://typelevel.org/blog/2016/02/04/variance-and-functors.html">https://typelevel.org/blog/2016/02/04/variance-and-functors.html</a>
</p>

<p>
You can take a look at the implementation of Covariant here:
</p>

<p>
<a href="https://github.com/zio/zio-prelude/blob/master/src/main/scala/zio/prelude/Covariant.scala">https://github.com/zio/zio-prelude/blob/master/src/main/scala/zio/prelude/Covariant.scala</a>
</p>

<p>
It's nice that each abstraction, or algebra, has it's own file, and in that file
you'll find the following.
</p>

<ol class="org-ol">
<li>A trait defining the interface to the algebra. For example, Covariant defines
map and a couple of other functions. In this respect it is similar to Cats.</li>
<li>Laws. The companion object contains the laws to test the algebra directly.
Each object has a <code>laws</code> member that can be checked with the package objects
<code>checkAllLaws</code> method.</li>
<li>Instances. Rather than have instances in a separate file or package, they are
also embedded in the companion. It's nice to have them all easily listed in
the same place. Most algebras have instances for some appropriate standard
library types, as well as some "ZIO" types like <code>ZIO</code> itself and <code>Chunk</code> and
new Prelude types like <code>ZPure</code> which we will get into in a later post.
Another thing I like is the code documentation is laid out like this
<code>`Covariant` instance for `Chunk`</code> so that if you want to find, say, all the
instances for ZIO you can do do a global text search for <code>instance for `ZIO`</code>
and you'll find them. This kind of thoughtful ergonomics is much appreciated.</li>
<li>Finally, at the end of the object implememtation you will find some syntax.
If you ever struggled with imports in Scalaz and Cats, you may appreciate
this one file per algebra layout.</li>
</ol>
</div>
</div>
