org/posts/2020-08-02-whats-ap-with-zio-prelude.org
*** Monads
In Cats we extend Functor with Applicative and add the ~flatMap~ operation to get
Monad. Applicative brings us both ~ap~ and ~pure~. Leaving ap aside for the
moment, pure is the important ability to lift a pure value into the context of
some effect, represented as a higher-kinded type.

Let's take a look at sequencing two Futures together using prelude. In
order to do that with Cats we would use the Monad flatmap operation.

#+BEGIN_SRC scala
def getUser(email: String): Future[User] = ???

def getAccountStatus(id: String): Future[AccountStatus] = ???

val accountStatus = getUser("bob@google.com")
  .flatMap(user => getAccountStatus(user.accountId))
#+END_SRC

In prelude you would do the same, since nothing overrides flatMap from ZIO or
the standard library, you can simply call flatMap, but you wouldn't be
exercising the new algebraic components that make up prelude, stay tuned.

Remember above that Monad is defined as the composition of IdentityFlatten and
Covariant. We already saw that Covariant is Functor and provides map (remember
that all Monad's are functors).

IdentityFlatten is the composition of prelude types Associative, Identity and
Flatten. Flatten is easy it just gives us the ability to flatten an effect from
an ~F[F[A]]~ to an ~F[A]~. For example, the somewhat contrived code below
executes a ZIO that is nested inside another, resulting in a ~ZIO[ZIO[A]]~. We
can use the ZIO Flatten instance to flatten and run the effects.

#+BEGIN_SRC scala
import zio._
val runtime = Runtime.default
val effect = ZIO{putStrLn("Hello!"); ZIO.succeed(10)}
runtime.unsafeRun(effect.flatten)
// Hello!
// Int = 10
#+END_SRC

Whilst most types, including ZIO effects, Future, Option and List all have
flatMap, we ~could~ define it in terms of ~Covariant~ and ~IdentityFlatten~ as follows.

#+BEGIN_SRC scala
def flatMap[F[+_]: Covariant : IdentityFlatten, A, B](fa: F[A])(fab: A => F[B]): F[B] = {
  fa.map(a => fab(a)).flatten
}
#+END_SRC

Monad also traditionally defines ~pure~, a way to lift pure values into an effect
context. We can do that with Covariant's ~map~ and IdentityFlatten's ~any~.
~any~ summons an effect out of thin air for us, and we can then use map to sneak
our pure value into that effect. Whilst this seems a little tricky, it gives a
bit more flexibility. As Adam Fraser puts it, this "also allows you to express
constraints on the types of values that can be injected through implementing
CovariantSubset instead of Covariant". Subsets were not featured in the
talk and I'll talk about those more in a future post once my understanding is
more solidified.

#+BEGIN_SRC scala
def pure[F[+_] : Covariant : IdentityFlatten, A](a: A)(implicit i : IdentityFlatten[F]): F[A] = {
  i.any.map(_ => a)
}
pure[Option,Int](12)
// Option[Int] = Some(12)
pure[List,String]("Hello")
// List[String] = List(Hello)
#+END_SRC

