_posts/2020-08-02-whats-ap-with-zio-prelude.html

<div id="outline-container-org4ca1745" class="outline-3">
<h3 id="org4ca1745">Monads</h3>
<div class="outline-text-3" id="text-org4ca1745">
<p>
In Cats we extend Functor with Applicative and add the <code>flatMap</code> operation to get
Monad. Applicative brings us both <code>ap</code> and <code>pure</code>. Leaving ap aside for the
moment, pure is the important ability to lift a pure value into the context of
some effect, represented as a higher-kinded type.
</p>

<p>
Let's take a look at sequencing two Futures together using prelude. In
order to do that with Cats we would use the Monad flatmap operation.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">getUser</span>(email<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">String</span>)<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Future</span>[<span style="color: #00bcff;">User</span>] <span style="color: #b6a0ff;">=</span> ???

<span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">getAccountStatus</span>(id<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">String</span>)<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Future</span>[<span style="color: #00bcff;">AccountStatus</span>] <span style="color: #b6a0ff;">=</span> ???

<span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">accountStatus</span> <span style="color: #b6a0ff;">=</span> getUser(<span style="color: #79a8ff;">"bob@google.com"</span>)
  .flatMap(user <span style="color: #b6a0ff;">=&gt;</span> getAccountStatus(user.accountId))
</pre>
</div>

<p>
In prelude you would do the same, since nothing overrides flatMap from ZIO or
the standard library, you can simply call flatMap, but you wouldn't be
exercising the new algebraic components that make up prelude, stay tuned.
</p>

<p>
Remember above that Monad is defined as the composition of IdentityFlatten and
Covariant. We already saw that Covariant is Functor and provides map (remember
that all Monad's are functors).
</p>

<p>
IdentityFlatten is the composition of prelude types Associative, Identity and
Flatten. Flatten is easy it just gives us the ability to flatten an effect from
an <code>F[F[A]]</code> to an <code>F[A]</code>. For example, the somewhat contrived code below
executes a ZIO that is nested inside another, resulting in a <code>ZIO[ZIO[A]]</code>. We
can use the ZIO Flatten instance to flatten and run the effects.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">import</span> zio.<span style="color: #b6a0ff;">_</span>
<span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">runtime</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">Runtime</span>.default
<span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">effect</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">ZIO</span>{putStrLn(<span style="color: #79a8ff;">"Hello!"</span>); <span style="color: #00bcff;">ZIO</span>.succeed(<span style="color: #00bcff;">10</span>)}
runtime.unsafeRun(effect.flatten)
<span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">Hello!</span>
<span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">Int = 10</span>
</pre>
</div>

<p>
Whilst most types, including ZIO effects, Future, Option and List all have
flatMap, we <code>could</code> define it in terms of <code>Covariant</code> and <code>IdentityFlatten</code> as follows.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">flatMap</span>[<span style="color: #00bcff;">F</span>[+<span style="color: #b6a0ff;">_</span>]<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Covariant</span> <span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">IdentityFlatten</span>, <span style="color: #00bcff;">A</span>, <span style="color: #00bcff;">B</span>](fa<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">F</span>[<span style="color: #00bcff;">A</span>])(fab<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">A</span> <span style="color: #b6a0ff;">=&gt;</span> <span style="color: #00bcff;">F</span>[<span style="color: #00bcff;">B</span>])<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">F</span>[<span style="color: #00bcff;">B</span>] <span style="color: #b6a0ff;">=</span> {
  fa.map(a <span style="color: #b6a0ff;">=&gt;</span> fab(a)).flatten
}
</pre>
</div>

<p>
Monad also traditionally defines <code>pure</code>, a way to lift pure values into an effect
context. We can do that with Covariant's <code>map</code> and IdentityFlatten's <code>any</code>.
<code>any</code> summons an effect out of thin air for us, and we can then use map to sneak
our pure value into that effect. Whilst this seems a little tricky, it gives a
bit more flexibility. As Adam Fraser puts it, this "also allows you to express
constraints on the types of values that can be injected through implementing
CovariantSubset instead of Covariant". Subsets were not featured in the
talk and I'll talk about those more in a future post once my understanding is
more solidified.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">pure</span>[<span style="color: #00bcff;">F</span>[+<span style="color: #b6a0ff;">_</span>] <span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Covariant</span> <span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">IdentityFlatten</span>, <span style="color: #00bcff;">A</span>](a<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">A</span>)(<span style="color: #f78fe7;">implicit</span> i <span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">IdentityFlatten</span>[<span style="color: #00bcff;">F</span>])<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">F</span>[<span style="color: #00bcff;">A</span>] <span style="color: #b6a0ff;">=</span> {
  i.any.map(<span style="color: #b6a0ff;">_</span> <span style="color: #b6a0ff;">=&gt;</span> a)
}
pure[<span style="color: #00bcff;">Option</span>,<span style="color: #00bcff;">Int</span>](<span style="color: #00bcff;">12</span>)
<span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">Option[Int] = Some(12)</span>
pure[<span style="color: #00bcff;">List</span>,<span style="color: #00bcff;">String</span>](<span style="color: #79a8ff;">"Hello"</span>)
<span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">List[String] = List(Hello)</span>
</pre>
</div>
</div>
</div>
</div>
