org/posts/2020-08-02-whats-ap-with-zio-prelude.org
** Applicatives in Prelude
In my original post we used the ap function to apply a function to an option
using the ap function. Whilst the purpose of this was to go to explain currying
so we can apply a function to multiple effects, as parameters, here let's just
replicated it with prelude.

In prelude the equivalent to Applicative is defined as follows.

#+BEGIN_SRC scala
type Applicative[F[+_]] = Covariant[F] with IdentityBoth[F]
#+END_SRC

Covariant should be familiar, it is Functor and gives us map. IdentityBoth is
Identity with AssociativeBoth.

Associative both is product from Cats. (product can be implemented with the ap
function from Applicative)

#+BEGIN_SRC scala
override def product[A, B](fa: F[A], fb: F[B]): F[(A, B)] =
  ap(map(fa)(a => (b: B) => (a, b)))(fb)

Applicative[Option].product(Option(10), Option(12)).map{case (a,b) => a + b}
// Option[Int] = Some(22)
#+END_SRC

In prelude product is essentialy defined directly as AssociativeBoth which
implements a binary associative operator to combine two effects into an effect
containing a tuple, in other words product.

#+BEGIN_SRC scala
AssociativeBoth[Option].both(Option(10), Option(12)).map{case (a,b) => a + b}
// Option[Int] = Some(22)
#+END_SRC

Applicative requires map, ap and pure. We have map from Covariant, the
equivalent of ap using both from AssociativeBoth and pure uses Identity just
like with our Monad example.

#+BEGIN_SRC scala
def pure[F[+_] : Covariant : IdentityBoth, A](a: A)(implicit i : IdentityBoth[F]): F[A] = {
  i.any.map(_ => a)
}
pure[Option,Int](12)
// res1: Option[Int] = Some(12)
pure[List,String]("Hello")
// res2: List[String] = List(Hello)
#+END_SRC

