_posts/2020-08-02-whats-ap-with-zio-prelude.html

<div id="outline-container-org976046e" class="outline-2">
<h2 id="org976046e">Applicatives in Prelude</h2>
<div class="outline-text-2" id="text-org976046e">
<p>
In my original post we used the ap function to apply a function to an option
using the ap function. Whilst the purpose of this was to go to explain currying
so we can apply a function to multiple effects, as parameters, here let's just
replicated it with prelude.
</p>

<p>
In prelude the equivalent to Applicative is defined as follows.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">type</span> <span style="color: #00bcff;">Applicative</span>[<span style="color: #00bcff;">F</span>[+<span style="color: #b6a0ff;">_</span>]] <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">Covariant</span>[<span style="color: #00bcff;">F</span>] <span style="color: #b6a0ff;">with</span> <span style="color: #6ae4b9;">IdentityBoth</span>[<span style="color: #00bcff;">F</span>]
</pre>
</div>

<p>
Covariant should be familiar, it is Functor and gives us map. IdentityBoth is
Identity with AssociativeBoth.
</p>

<p>
Associative both is product from Cats. (product can be implemented with the ap
function from Applicative)
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #f78fe7;">override</span> <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">product</span>[<span style="color: #00bcff;">A</span>, <span style="color: #00bcff;">B</span>](fa<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">F</span>[<span style="color: #00bcff;">A</span>], fb<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">F</span>[<span style="color: #00bcff;">B</span>])<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">F</span>[(<span style="color: #00bcff;">A</span>, <span style="color: #00bcff;">B</span>)] <span style="color: #b6a0ff;">=</span>
  ap(map(fa)(a <span style="color: #b6a0ff;">=&gt;</span> (b<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">B</span>) <span style="color: #b6a0ff;">=&gt;</span> (a, b)))(fb)

<span style="color: #00bcff;">Applicative</span>[<span style="color: #00bcff;">Option</span>].product(<span style="color: #00bcff;">Option</span>(<span style="color: #00bcff;">10</span>), <span style="color: #00bcff;">Option</span>(<span style="color: #00bcff;">12</span>)).map{<span style="color: #b6a0ff;">case</span> (<span style="color: #00d3d0;">a</span>,<span style="color: #00d3d0;">b</span>) <span style="color: #b6a0ff;">=&gt;</span> a + b}
<span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">Option[Int] = Some(22)</span>
</pre>
</div>

<p>
In prelude product is essentialy defined directly as AssociativeBoth which
implements a binary associative operator to combine two effects into an effect
containing a tuple, in other words product.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #00bcff;">AssociativeBoth</span>[<span style="color: #00bcff;">Option</span>].both(<span style="color: #00bcff;">Option</span>(<span style="color: #00bcff;">10</span>), <span style="color: #00bcff;">Option</span>(<span style="color: #00bcff;">12</span>)).map{<span style="color: #b6a0ff;">case</span> (<span style="color: #00d3d0;">a</span>,<span style="color: #00d3d0;">b</span>) <span style="color: #b6a0ff;">=&gt;</span> a + b}
<span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">Option[Int] = Some(22)</span>
</pre>
</div>

<p>
Applicative requires map, ap and pure. We have map from Covariant, the
equivalent of ap using both from AssociativeBoth and pure uses Identity just
like with our Monad example.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">pure</span>[<span style="color: #00bcff;">F</span>[+<span style="color: #b6a0ff;">_</span>] <span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Covariant</span> <span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">IdentityBoth</span>, <span style="color: #00bcff;">A</span>](a<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">A</span>)(<span style="color: #f78fe7;">implicit</span> i <span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">IdentityBoth</span>[<span style="color: #00bcff;">F</span>])<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">F</span>[<span style="color: #00bcff;">A</span>] <span style="color: #b6a0ff;">=</span> {
  i.any.map(<span style="color: #b6a0ff;">_</span> <span style="color: #b6a0ff;">=&gt;</span> a)
}
pure[<span style="color: #00bcff;">Option</span>,<span style="color: #00bcff;">Int</span>](<span style="color: #00bcff;">12</span>)
<span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">res1: Option[Int] = Some(12)</span>
pure[<span style="color: #00bcff;">List</span>,<span style="color: #00bcff;">String</span>](<span style="color: #79a8ff;">"Hello"</span>)
<span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">res2: List[String] = List(Hello)</span>
</pre>
</div>
</div>
</div>
