org/posts/2020-08-02-whats-ap-with-zio-prelude.org
** Sequence and Traverse
In the seminal paper Applicative programming with Effects, the first motivating
example for applicative programming is the sequence function. You have a list of
effects, specifically Haskell IO effects, and you would like to turn them into
an ~IO[List[A]]~. You might recognise this as having the same shape and purpose
as Future.sequence from the Scala standard library. sequence is built with its
more powerful friend traverse.

#+BEGIN_SRC scala
Future.sequence is a function IterableOnce[Future[A]] => Future[IterableOnce[A]]
Future.traverse is a function IterableOnce[A], A => Future[B] => Future[IterableOnce[B]]
#+END_SRC

In Typelevel Cats, the Traverse typeclass makes this more flexible by allows us
to traverse over any type that is a functor (you can map over it) and foldable
(you can fold it with foldLeft, foldRight and fold).

#+BEGIN_SRC scala
trait Traverse[F[_]] extends Functor[F] with Foldable[F] {
 def traverse[G[_]: Applicative, A, B](fa: F[A])(f: A => G[B]): G[F[B]]
}
#+END_SRC

What's interesting about Traverse is that it relies on a number of type classes
to build its expressive power. Ultimately our little friend ~ap~ is the king pin
of the whole thing, allowing us to combine the effects together as we fold in a
way that is "idiomatic" to the effect type. When we traverse a list of Id for
example (the identity monad) we get map, and when we traverse a list of Const,
we get fold. In other words changing the data type is all we need to make
drastically different programs.

To demonstrate this in my applicative post, I wrote an implementation of a silly
algorithm called Sleep Sort. Sleep Sort works by waiting an amount of time-based
on the value of the number. Emitting the numbers in this way sorts them
(assuming your scheduler is accurate enough). Let's be clear, this is a stupid
way to sort numbers, but it does represent some real-world needs we have like
being able to run effects in parallel.

#+BEGIN_SRC scala
import zio._
import zio.prelude._
import zio.console._
import zio.clock._
def delayedPrintNumber(s: Int): ZIO[Console with Clock,String,Int] = {
    putStrLn(s"Preparing to say number in $s seconds") *>
    putStrLn(s"$s").delay(s.seconds) *>
    ZIO.succeed(s)
}
val ios = List(6,5,2,1,3,8,4,7).map(delayedPrintNumber)
// ios: List[ZIO[Console with Clock,String,Int]]
#+END_SRC

Using Cats we can use Traverse.sequence to flip the List[Zio] to ZIO[List] and
then execute it.

#+BEGIN_SRC scala
import cats.__
import cats.Traverse
val runtime = Runtime.default
val program = Traverse[List].traverse(ios)
runtime.unsafeRun(program)
#+END_SRC

Sadly we find this does not work because wanted all the effects to start at once
and then complete at their alloted times, making the sort work. Instead we'll
see each executed in sequence.

#+BEGIN_SRC
Monadic version

Preparing to say number in 6 seconds
6
Preparing to say number in 5 seconds
5
// ... and so on for a while
#+END_SRC

Happily thanks to the joys of Applicative we can fix this by changing the data
type. If we rewrite using Cats Effect we wrap our IO into a different type
called Par.IO which has a different implementation of applicative that does NOT
sequence the IOs together but allows them to run in parallel, we can get the
sleep sort behaviour. We didn't change the structure of our code, just the data
type!

Now all of the effects started at the same time and ran in parallel.

#+BEGIN_SRC
Preparing to say number in 6 seconds
Preparing to say number in 2 seconds
Preparing to say number in 1 seconds
Preparing to say number in 3 seconds
Preparing to say number in 8 seconds
Preparing to say number in 4 seconds
Preparing to say number in 7 seconds
Preparing to say number in 5 seconds
1
2
3
4
5
6
7
8
#+END_SRC

** ZIO Effects and Prelude
Let's visit the same problem using our ZIO effects above. One thing I really
like about prelude is how combinations of its algebras are mapped to ZIO
effects. In this table we have two ZIO effects ~fa : ZIO[R, E, A]~ and ~fb :
ZIO[R, E, B]~ that are combined in different ways just by changing the algebra.

| Algebra           | ZIO instance implementation | Description                                                  |
|-------------------+-----------------------------+--------------------------------------------------------------|
| AssociativeBoth   | fa zip fb                   | fa first then fb iff fa succeeds, returning ZIO[R,E,(A,B)]   |
| AssociativeEither | fa.orElseEither(fb)         | fa first then if it fails fb, returning ZIO[R,E,Either[A,B]] |
| CommutativeBoth   | fa zipPar fb                | fa and fb at the same time, returning ZIO[R,E,(A,B)]         |

This is really nice and similar in spirit to what we did with Cats Traverse.

ZIO's implementation of Traverse has eschewed conventional names for some
functions in favour or more common words, so for example sequence is just flip,
which describes the flipping of the ~F[G[A]]~ to a ~G[F[A]]~. We should be able
to just flip our list of ZIOs and execute them using traverse.

However, when we come back to Traverable prelude's (version of Traverse) there
are two difficulties.

