_posts/2020-08-02-whats-ap-with-zio-prelude.html

<div id="outline-container-org86f0a9e" class="outline-2">
<h2 id="org86f0a9e">Sequence and Traverse</h2>
<div class="outline-text-2" id="text-org86f0a9e">
<p>
In the seminal paper Applicative programming with Effects, the first motivating
example for applicative programming is the sequence function. You have a list of
effects, specifically Haskell IO effects, and you would like to turn them into
an <code>IO[List[A]]</code>. You might recognise this as having the same shape and purpose
as Future.sequence from the Scala standard library. sequence is built with its
more powerful friend traverse.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #00bcff;">Future</span>.sequence is a function <span style="color: #00bcff;">IterableOnce</span>[<span style="color: #00bcff;">Future</span>[<span style="color: #00bcff;">A</span>]] <span style="color: #b6a0ff;">=&gt;</span> <span style="color: #00bcff;">Future</span>[<span style="color: #00bcff;">IterableOnce</span>[<span style="color: #00bcff;">A</span>]]
<span style="color: #00bcff;">Future</span>.traverse is a function <span style="color: #00bcff;">IterableOnce</span>[<span style="color: #00bcff;">A</span>], <span style="color: #00bcff;">A</span> <span style="color: #b6a0ff;">=&gt;</span> <span style="color: #00bcff;">Future</span>[<span style="color: #00bcff;">B</span>] <span style="color: #b6a0ff;">=&gt;</span> <span style="color: #00bcff;">Future</span>[<span style="color: #00bcff;">IterableOnce</span>[<span style="color: #00bcff;">B</span>]]
</pre>
</div>

<p>
In Typelevel Cats, the Traverse typeclass makes this more flexible by allows us
to traverse over any type that is a functor (you can map over it) and foldable
(you can fold it with foldLeft, foldRight and fold).
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">trait</span> <span style="color: #6ae4b9;">Traverse</span>[<span style="color: #00bcff;">F</span>[<span style="color: #b6a0ff;">_</span>]] <span style="color: #b6a0ff;">extends</span> <span style="color: #6ae4b9;">Functor</span>[<span style="color: #00bcff;">F</span>] <span style="color: #b6a0ff;">with</span> <span style="color: #6ae4b9;">Foldable</span>[<span style="color: #00bcff;">F</span>] {
 <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">traverse</span>[<span style="color: #00bcff;">G</span>[<span style="color: #b6a0ff;">_</span>]<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Applicative</span>, <span style="color: #00bcff;">A</span>, <span style="color: #00bcff;">B</span>](fa<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">F</span>[<span style="color: #00bcff;">A</span>])(f<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">A</span> <span style="color: #b6a0ff;">=&gt;</span> <span style="color: #00bcff;">G</span>[<span style="color: #00bcff;">B</span>])<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">G</span>[<span style="color: #00bcff;">F</span>[<span style="color: #00bcff;">B</span>]]
}
</pre>
</div>

<p>
What's interesting about Traverse is that it relies on a number of type classes
to build its expressive power. Ultimately our little friend <code>ap</code> is the king pin
of the whole thing, allowing us to combine the effects together as we fold in a
way that is "idiomatic" to the effect type. When we traverse a list of Id for
example (the identity monad) we get map, and when we traverse a list of Const,
we get fold. In other words changing the data type is all we need to make
drastically different programs.
</p>

<p>
To demonstrate this in my applicative post, I wrote an implementation of a silly
algorithm called Sleep Sort. Sleep Sort works by waiting an amount of time-based
on the value of the number. Emitting the numbers in this way sorts them
(assuming your scheduler is accurate enough). Let's be clear, this is a stupid
way to sort numbers, but it does represent some real-world needs we have like
being able to run effects in parallel.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">import</span> zio.<span style="color: #b6a0ff;">_</span>
<span style="color: #b6a0ff;">import</span> zio.prelude.<span style="color: #b6a0ff;">_</span>
<span style="color: #b6a0ff;">import</span> zio.console.<span style="color: #b6a0ff;">_</span>
<span style="color: #b6a0ff;">import</span> zio.clock.<span style="color: #b6a0ff;">_</span>
<span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">delayedPrintNumber</span>(s<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">Int</span>)<span style="color: #b6a0ff;">:</span> <span style="color: #6ae4b9;">ZIO</span>[<span style="color: #00bcff;">Console</span> <span style="color: #b6a0ff;">with</span> <span style="color: #6ae4b9;">Clock</span>,<span style="color: #00bcff;">String</span>,<span style="color: #00bcff;">Int</span>] <span style="color: #b6a0ff;">=</span> {
    putStrLn(s<span style="color: #79a8ff;">"Preparing to say number in </span><span style="color: #00d3d0;">$s</span><span style="color: #79a8ff;"> seconds"</span>) *&gt;
    putStrLn(s<span style="color: #79a8ff;">"</span><span style="color: #00d3d0;">$s</span><span style="color: #79a8ff;">"</span>).delay(s.seconds) *&gt;
    <span style="color: #00bcff;">ZIO</span>.succeed(s)
}
<span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">ios</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">List</span>(<span style="color: #00bcff;">6</span>,<span style="color: #00bcff;">5</span>,<span style="color: #00bcff;">2</span>,<span style="color: #00bcff;">1</span>,<span style="color: #00bcff;">3</span>,<span style="color: #00bcff;">8</span>,<span style="color: #00bcff;">4</span>,<span style="color: #00bcff;">7</span>).map(delayedPrintNumber)
<span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">ios: List[ZIO[Console with Clock,String,Int]]</span>
</pre>
</div>

<p>
Using Cats we can use Traverse.sequence to flip the List[Zio] to ZIO[List] and
then execute it.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">import</span> cats.__
<span style="color: #b6a0ff;">import</span> cats.<span style="color: #00bcff;">Traverse</span>
<span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">runtime</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">Runtime</span>.default
<span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">program</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">Traverse</span>[<span style="color: #00bcff;">List</span>].traverse(ios)
runtime.unsafeRun(program)
</pre>
</div>

<p>
Sadly we find this does not work because wanted all the effects to start at once
and then complete at their alloted times, making the sort work. Instead we'll
see each executed in sequence.
</p>

<pre class="example">
Monadic version

Preparing to say number in 6 seconds
6
Preparing to say number in 5 seconds
5
// ... and so on for a while
</pre>

<p>
Happily thanks to the joys of Applicative we can fix this by changing the data
type. If we rewrite using Cats Effect we wrap our IO into a different type
called Par.IO which has a different implementation of applicative that does NOT
sequence the IOs together but allows them to run in parallel, we can get the
sleep sort behaviour. We didn't change the structure of our code, just the data
type!
</p>

<p>
Now all of the effects started at the same time and ran in parallel.
</p>

<pre class="example">
Preparing to say number in 6 seconds
Preparing to say number in 2 seconds
Preparing to say number in 1 seconds
Preparing to say number in 3 seconds
Preparing to say number in 8 seconds
Preparing to say number in 4 seconds
Preparing to say number in 7 seconds
Preparing to say number in 5 seconds
1
2
3
4
5
6
7
8
</pre>
</div>
</div>

<div id="outline-container-org945ad7b" class="outline-2">
<h2 id="org945ad7b">ZIO Effects and Prelude</h2>
<div class="outline-text-2" id="text-org945ad7b">
<p>
Let's visit the same problem using our ZIO effects above. One thing I really
like about prelude is how combinations of its algebras are mapped to ZIO
effects. In this table we have two ZIO effects <code>fa : ZIO[R, E, A]</code> and <code>fb :
ZIO[R, E, B]</code> that are combined in different ways just by changing the algebra.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Algebra</th>
<th scope="col" class="org-left">ZIO instance implementation</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">AssociativeBoth</td>
<td class="org-left">fa zip fb</td>
<td class="org-left">fa first then fb iff fa succeeds, returning ZIO[R,E,(A,B)]</td>
</tr>

<tr>
<td class="org-left">AssociativeEither</td>
<td class="org-left">fa.orElseEither(fb)</td>
<td class="org-left">fa first then if it fails fb, returning ZIO[R,E,Either[A,B]]</td>
</tr>

<tr>
<td class="org-left">CommutativeBoth</td>
<td class="org-left">fa zipPar fb</td>
<td class="org-left">fa and fb at the same time, returning ZIO[R,E,(A,B)]</td>
</tr>
</tbody>
</table>

<p>
This is really nice and similar in spirit to what we did with Cats Traverse.
</p>

<p>
ZIO's implementation of Traverse has eschewed conventional names for some
functions in favour or more common words, so for example sequence is just flip,
which describes the flipping of the <code>F[G[A]]</code> to a <code>G[F[A]]</code>. We should be able
to just flip our list of ZIOs and execute them using traverse.
</p>

<p>
However, when we come back to Traverable prelude's (version of Traverse) there
are two difficulties.
</p>
</div>
