org/posts/2020-08-02-whats-ap-with-zio-prelude.org
*** Problem 1. Traversable doesn't handle empty structures
Perhaps by design, you cannot just take a list of ZIO effects and Traverse them,
because the flip function requires the G parameter to have the IdentityBoth
algebra. That algebra lets us combine two effects to a tuple, and there is an
identity element. ZIO effects do not have an instance of the IdentityBoth
algebra and as such cannot be used with Traverable.

We can get around this by using the NonEmptyTraversable which implements the
Traversable type class for non-empty structures. Its functions are postfixed
with a 1 to indicate they require at least one element to work with, and use
AssociativeBoth algebra which ZIO has as you can see above.

*** Problem 2. We don't have a way to change from sequenced to parallel execution
When we were dealing with Applicatives we can change the data type to select a
different applicative and get a different combining method. This is a crucial
part of Traverse IMHO. This functionality is missing because the algebra is
hardcoded. We can't used the Algebra of choice from the table above (we would
need to use CommutativeBoth to get the parallel execution the sleep sort needs).

*** Running the code
#+BEGIN_SRC scala
val runtime = Runtime.default
runtime.unsafeRun(NonEmptyTraversable[NonEmptyList].flip1(ios))
#+END_SRC

Sadly the best we can do at the moment is to use flip1 but we are limited to
sequential execution.

*** Possible Solutions
I talked to Adam Fraser about this and the probable solution will be a
forthcoming newtype called Parallel which can wrap your effects with. This would
work but feels a bit strange because we already had algebras that change
behaviours but we can't freely use them in this context, and having additional
newtypes seems like it violates the don't repeat yourself (DRY) principle.

Another possible solution would be to have additional Traverse types with
different algebras. Neither solution seems as clean as the Applicative one at
this point.

One advantage of Applicatives is that you can compose any two with each other.
As an advanced example from one of my talks I compose Const, IO and Parallel
together, and take advantage of Monoidal composition, to execute a list of IO
operations and gather statistics on the results as well as collecting the
values. 

#+BEGIN_SRC scala
val program = Traverse[List].traverse(List(1,2,3,4,8)) {
  n =>
  Nested[IO.Par,Const[(Long, Int, List[String], List[Long]),?], String](
    Par(time(exampleIO(n)).map{
      case _ =>  (time, a) =>
         Const((time, 1, List(a), List(time)))
        })
  )
}
#+END_SRC

https://youtu.be/T_0IE8PF1sY
https://docs.google.com/presentation/d/1MvPBfmUIOuvM-vjjYz6lrhQNQ7hPLzKkTR9I73uoTak/edit?usp=sharing

In theory Prelude should be able to bring the same level of composition; maybe
even surpass it.

** Some final defense for ap
Whilst ap is certainly not a perfect for Scala, what it does have going for it
from a pedagogical point of view is that you can teach Functor, Monad and
Applicative as being three ways to map a ~F[A] => F[B]~. The only difference
between them is the "shape" of the function you use to do the mapping. With
functor the pure function ~A => B~ defines the Functor as letting us run a pure
function on an effect. With flatMap the function ~A => F[B]~ lets us compose two
effects together, with the result of one passed to the second. And finally, with
Applicative, the ~F[A => B]~ function is the building block for running two
independent effects together.

With that out of the way, and with the student sufficiently guided through the
process of currying and the implementation of map2, map3 etc, we can move on
from ap and maybe never look at it again. Applicative is still applicative
whether you formulate it with ~pure~ and ~ap~, with ~product~, or with ~map2~.
You can enjoy the benefits of Applicative without adopting the red-headed
stepchild we call ~ap~.

** Things I missed
I intend to write more on Prelude soon, but until I do here the bits I didn't
mention that are nevertheless very interesting features.

Variance. If you tend to ignore variance in your Scala that will likely change
in Prelude. I tend to stick to invariant types a lot of the time, but Prelude's
design encourages call site variance, and we should start to see interesting
examples of what that empowers us to do more of. In the talk John's example was
that he wanted to map an A to B but have more control over what the B is;
perhaps it is a Spark serializable type...

ZPure. When ZIO came along it brought the idea of getting rid of stacks of Monad
transformers by putting all that functionality (error channels, read-only
environments) into an effect. With ZPure we get to do a similar thing for none
IO effects. ZPure gives you a State monad, a read only environment. I expect
ZPure will be an important building block for ZIO and Prelude code, and I'm
looking forward to playing with it some more.

Newtypes. Prelude comes With a nice newtype implementation. I haven't looked
into it much, but it seems to work quite well with minimal effort.

** Wrapping things up
As zio-prelude evolves I expect it will at first grow, then shed some features
into modules or libraries, before shrinking to a smaller but coherent core.

At this point I believe Prelude is a very interesting new addition to the Scala
functional programming library ecosystem. Those experienced with the
Haskell-like way of doing things will probably find its way of doing things
pretty strange at first, and I don't know how long that feeling will last.

Another question is whether functional programming in Scala will further
bifurcate. As Prelude and ZIO become more closely intertwined (they already
depend on each other), I expect that some people will be put off by the novelty
of Prelude and stick with the Cats ecosystem, while others will avoid things
built on Cats in order to stay in the ZIO and Prelude world.

Ultimately time will tell whether Prelude's approach will make a big impact on
Scala functional programming. In any event the best ideas will live on.

\copy 2020 Justin Heyes-Jones. All Rights Reserved.
