_posts/2020-08-02-whats-ap-with-zio-prelude.html

<div id="outline-container-org04dd83b" class="outline-3">
<h3 id="org04dd83b">Problem 1. Traversable doesn't handle empty structures</h3>
<div class="outline-text-3" id="text-org04dd83b">
<p>
Perhaps by design, you cannot just take a list of ZIO effects and Traverse them,
because the flip function requires the G parameter to have the IdentityBoth
algebra. That algebra lets us combine two effects to a tuple, and there is an
identity element. ZIO effects do not have an instance of the IdentityBoth
algebra and as such cannot be used with Traverable.
</p>

<p>
We can get around this by using the NonEmptyTraversable which implements the
Traversable type class for non-empty structures. Its functions are postfixed
with a 1 to indicate they require at least one element to work with, and use
AssociativeBoth algebra which ZIO has as you can see above.
</p>
</div>
</div>

<div id="outline-container-org302cf8f" class="outline-3">
<h3 id="org302cf8f">Problem 2. We don't have a way to change from sequenced to parallel execution</h3>
<div class="outline-text-3" id="text-org302cf8f">
<p>
When we were dealing with Applicatives we can change the data type to select a
different applicative and get a different combining method. This is a crucial
part of Traverse IMHO. This functionality is missing because the algebra is
hardcoded. We can't used the Algebra of choice from the table above (we would
need to use CommutativeBoth to get the parallel execution the sleep sort needs).
</p>
</div>
</div>

<div id="outline-container-orgfdc6661" class="outline-3">
<h3 id="orgfdc6661">Running the code</h3>
<div class="outline-text-3" id="text-orgfdc6661">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">runtime</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">Runtime</span>.default
runtime.unsafeRun(<span style="color: #00bcff;">NonEmptyTraversable</span>[<span style="color: #00bcff;">NonEmptyList</span>].flip1(ios))
</pre>
</div>

<p>
Sadly the best we can do at the moment is to use flip1 but we are limited to
sequential execution.
</p>
</div>
</div>

<div id="outline-container-org47e5877" class="outline-3">
<h3 id="org47e5877">Possible Solutions</h3>
<div class="outline-text-3" id="text-org47e5877">
<p>
I talked to Adam Fraser about this and the probable solution will be a
forthcoming newtype called Parallel which can wrap your effects with. This would
work but feels a bit strange because we already had algebras that change
behaviours but we can't freely use them in this context, and having additional
newtypes seems like it violates the don't repeat yourself (DRY) principle.
</p>

<p>
Another possible solution would be to have additional Traverse types with
different algebras. Neither solution seems as clean as the Applicative one at
this point.
</p>

<p>
One advantage of Applicatives is that you can compose any two with each other.
As an advanced example from one of my talks I compose Const, IO and Parallel
together, and take advantage of Monoidal composition, to execute a list of IO
operations and gather statistics on the results as well as collecting the
values. 
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #b6a0ff;">val</span> <span style="color: #00d3d0;">program</span> <span style="color: #b6a0ff;">=</span> <span style="color: #00bcff;">Traverse</span>[<span style="color: #00bcff;">List</span>].traverse(<span style="color: #00bcff;">List</span>(<span style="color: #00bcff;">1</span>,<span style="color: #00bcff;">2</span>,<span style="color: #00bcff;">3</span>,<span style="color: #00bcff;">4</span>,<span style="color: #00bcff;">8</span>)) {
  n <span style="color: #b6a0ff;">=&gt;</span>
  <span style="color: #00bcff;">Nested</span>[<span style="color: #00bcff;">IO</span>.<span style="color: #00bcff;">Par</span>,<span style="color: #00bcff;">Const</span>[(<span style="color: #00bcff;">Long</span>, <span style="color: #00bcff;">Int</span>, <span style="color: #00bcff;">List</span>[<span style="color: #00bcff;">String</span>], <span style="color: #00bcff;">List</span>[<span style="color: #00bcff;">Long</span>]),?], <span style="color: #00bcff;">String</span>](
    <span style="color: #00bcff;">Par</span>(time(exampleIO(n)).map{
      <span style="color: #b6a0ff;">case</span> <span style="color: #b6a0ff;">_</span> <span style="color: #b6a0ff;">=&gt;</span>  (time, a) <span style="color: #b6a0ff;">=&gt;</span>
         <span style="color: #00bcff;">Const</span>((time, <span style="color: #00bcff;">1</span>, <span style="color: #00bcff;">List</span>(a), <span style="color: #00bcff;">List</span>(time)))
        })
  )
}
</pre>
</div>

<p>
<a href="https://youtu.be/T_0IE8PF1sY">https://youtu.be/T_0IE8PF1sY</a>
<a href="https://docs.google.com/presentation/d/1MvPBfmUIOuvM-vjjYz6lrhQNQ7hPLzKkTR9I73uoTak/edit?usp=sharing">https://docs.google.com/presentation/d/1MvPBfmUIOuvM-vjjYz6lrhQNQ7hPLzKkTR9I73uoTak/edit?usp=sharing</a>
</p>

<p>
In theory Prelude should be able to bring the same level of composition; maybe
even surpass it.
</p>
</div>
</div>
</div>

<div id="outline-container-org705e9a7" class="outline-2">
<h2 id="org705e9a7">Some final defense for ap</h2>
<div class="outline-text-2" id="text-org705e9a7">
<p>
Whilst ap is certainly not a perfect for Scala, what it does have going for it
from a pedagogical point of view is that you can teach Functor, Monad and
Applicative as being three ways to map a <code>F[A] =&gt; F[B]</code>. The only difference
between them is the "shape" of the function you use to do the mapping. With
functor the pure function <code>A =&gt; B</code> defines the Functor as letting us run a pure
function on an effect. With flatMap the function <code>A =&gt; F[B]</code> lets us compose two
effects together, with the result of one passed to the second. And finally, with
Applicative, the <code>F[A =&gt; B]</code> function is the building block for running two
independent effects together.
</p>

<p>
With that out of the way, and with the student sufficiently guided through the
process of currying and the implementation of map2, map3 etc, we can move on
from ap and maybe never look at it again. Applicative is still applicative
whether you formulate it with <code>pure</code> and <code>ap</code>, with <code>product</code>, or with <code>map2</code>.
You can enjoy the benefits of Applicative without adopting the red-headed
stepchild we call <code>ap</code>.
</p>
</div>
</div>

<div id="outline-container-org8d6603c" class="outline-2">
<h2 id="org8d6603c">Things I missed</h2>
<div class="outline-text-2" id="text-org8d6603c">
<p>
I intend to write more on Prelude soon, but until I do here the bits I didn't
mention that are nevertheless very interesting features.
</p>

<p>
Variance. If you tend to ignore variance in your Scala that will likely change
in Prelude. I tend to stick to invariant types a lot of the time, but Prelude's
design encourages call site variance, and we should start to see interesting
examples of what that empowers us to do more of. In the talk John's example was
that he wanted to map an A to B but have more control over what the B is;
perhaps it is a Spark serializable type&#x2026;
</p>

<p>
ZPure. When ZIO came along it brought the idea of getting rid of stacks of Monad
transformers by putting all that functionality (error channels, read-only
environments) into an effect. With ZPure we get to do a similar thing for none
IO effects. ZPure gives you a State monad, a read only environment. I expect
ZPure will be an important building block for ZIO and Prelude code, and I'm
looking forward to playing with it some more.
</p>

<p>
Newtypes. Prelude comes With a nice newtype implementation. I haven't looked
into it much, but it seems to work quite well with minimal effort.
</p>
</div>
</div>

<div id="outline-container-orgda4659c" class="outline-2">
<h2 id="orgda4659c">Wrapping things up</h2>
<div class="outline-text-2" id="text-orgda4659c">
<p>
As zio-prelude evolves I expect it will at first grow, then shed some features
into modules or libraries, before shrinking to a smaller but coherent core.
</p>

<p>
At this point I believe Prelude is a very interesting new addition to the Scala
functional programming library ecosystem. Those experienced with the
Haskell-like way of doing things will probably find its way of doing things
pretty strange at first, and I don't know how long that feeling will last.
</p>

<p>
Another question is whether functional programming in Scala will further
bifurcate. As Prelude and ZIO become more closely intertwined (they already
depend on each other), I expect that some people will be put off by the novelty
of Prelude and stick with the Cats ecosystem, while others will avoid things
built on Cats in order to stay in the ZIO and Prelude world.
</p>

<p>
Ultimately time will tell whether Prelude's approach will make a big impact on
Scala functional programming. In any event the best ideas will live on.
</p>

<p>
&copy; 2020 Justin Heyes-Jones. All Rights Reserved.
</p>
</div>
</div>
